[
{"code": "AB9102", "description": "This course involves students in in-depth examination and discussion of the 5 key areas in forensic accounting and fraud investigation as follows:\nA. Uncovering white collar crimes especially in the areas of accounting and financial fraud:\n1. Fraudulent Financial Reporting: financial statement fraud schemes, ways in which financial statements are manipulated with fraudulent intent and financial fraud risk actors.\n2. Detecting Fraud in Financial Reporting: roles and procedures associated with internal and external auditors, the audit committee, board of directors, management and the forensic accountant. \n3. Employee Fraud: embezzlement, cash and check schemes, accounts receivable fraud, inventory fraud, accounts payable fraud, fictitious disbursements.\n4. Fraud and Company's Risk Assessment: tools and techniques to assess risk of fraud in a company: including timeline (event/project management) and link analysis, invigilation and proof of cash. Fraud prevention, detection, and mitigation measures.\n5. Indirect Methods of Reconstructing Income: market segment specialization program, source and application of funds method, net worth method, bank deposit method.\n\nB. Litigation Support\n1. Commercial Damages: the legal framework of damages; various damage calculation approaches; cost behaviour assumptions and the time value of money.\n2. Litigation Support in Special Situations: the accountant's role in antitrust litigation - estimation of cost behaviour patterns, including techniques such as regression/correlation analysis.\n3. Computing Economic Damages Overview: differences between measuring commercial damages and measuring personal injury damages; how to measure damages for personal injury and wrongful death cases - economic components and discounting amounts to the present value.\n\nC. Cybercrime\n1. Investigation of digital data: a brief introduction to computer forensics and forensic techniques. Explore the preservation of digital evidence, data mining concepts and strategies.\n2. Digital Forensic Analysis: using forensic audit, internet protocols, find and trace IP addresses, Applying internet and social media to perform tracing.\n3. Cybercrime Management: legal issues - Applying Singapore laws to fight cybercrimes.\n4. Cybercrime loss valuations: place valuation on losses; identify the  types of tangible and intangible losses that can occur during a cyber attack. \n\nD. Business Valuations\n1. Fundamentals: general types of valuations, fair market value, investment value, intrinsic value, size of ownership interest impact on value.\n2. The three common valuation approaches: Income Approach, Market Approach, Cost Approach\n3. Business Valuation Reports: organization, mechanics, main sections of the report.\n\nE. Forensic Accounting and financial fraud cases sharing\n1. Declassified Singapore and international Case Study", "title": "FORENSIC ACCOUNTING AND FRAUD INVESTIGATION", "preclusion": "AC9104", "credit": "3.0", "department": "ACC", "gradeType": "", "availability": [], "prerequisite": "AC1102 or AD1101 or AB1101"},
{"code": "AC1101", "description": "Accounting is the language of business. This course aims to provide students with a broad understanding of business, the role of accounting in business, the analysis, recording, summarizing, and reporting of business transactions, and the use of information for planning, performance measurement and control.\n\nThe course is divided into three sections. The first section aims to enhance the students' understanding of business and the role of accounting in business. It covers why businesses exist, and how businesses create value for their stakeholders. This section also introduces stakeholder theory, examines the stakeholders' interests in the businesses; and the information needs of these stakeholders.\n\nThe second section aims to provide a sound understanding of how business activities are measured and communicated to stakeholders through the accounting information system. It covers the elements of financial statements, double entry bookkeeping system, accounting for financing, investing and operating activities; and the preparation of income statement and classified balance sheet. \n\nThe final section of the course introduces agency and contract theories and the use of organizational architecture to minimize agency costs. It also focuses on the use of accounting information for decision making, planning, performance measurement and control. It covers financial statements analysis, cost-volume-profit analysis, the use of relevant information in decision making scenarios, budgeting, responsibility accounting and the use of balanced scorecard to improve performance evaluation.", "title": "ACCOUNTING I", "preclusion": "AB1101, AD1101, BU8101", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BUS 1, BUS 2, BUS 3, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECON, EEE, EEEC, ELH, ENE, ENEC, ENG, IEEC, IEM, LMS, MAEC, MAT, MATH, ME, ME(DES), ME(MEC), MEEC, MEEC(DES), MEEC(MEC), MS, MS(ITG), MS-2ndMaj/Spec(ITG), MS-2ndMaj/Spec(MSB), MS-2ndMaj/Spec(NULL), MTEC, PHY, PPGA, PSY, SOC, SSM", "Not available to all Programme with: ", "(Admyr 2014-2050), 2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(MKG)"], "prerequisite": ""},
{"code": "AC1102", "description": "This course introduces students to accounting as a process of measuring and disclosing information that facilitates economic decisions made by external decision makers. Students will learn how the quality of such information could be affected by various factors. Some of the concepts covered in AA101 such as strategy, business processes, agency theory and information risk will be revisited here. The course will explain the need for a conceptual framework followed by discussion of the elements of financial statements. The conceptual issues relating to the recognition and measurement of each element in the financial statements will be examined, followed by discussion of the related accounting standards.\n\nBy the end of the course, students will be equipped with a strong conceptual and technical knowledge in the recognition and measurement of the elements of the financial statements and will also be able to prepare a set of financial statements, and appreciate how accounting plays a role in measuring and disclosing information that facilitates the control of an organization's processes and improves the economic decisions made by organizational agents and stakeholders.", "title": "ACCOUNTING II", "preclusion": "AB1102", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 3, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BUS 1, BUS 2, BUS(2014-2050), CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECON, EEE, EEEC, EESS, ELH, ENE, ENEC, ENG, IEEC, IEM, LMS, MAEC, MAT, MATH, ME, ME(DES), ME(MEC), MEEC, MEEC(DES), MEEC(MEC), MS, MS-2ndMaj/Spec(MSB), MS-2ndMaj/Spec(NULL), MTEC, PHIL, PHY, PPGA, PSY, SOC, SSM", "Not available to all Programme with: ", "2nd Maj/Spec(BUS)"], "prerequisite": "AC1101 or AB1101 or AA101"},
{"code": "AC2101", "description": "This course equips students with a strong conceptual and technical knowledge of the recognition and measurement of various financial statements elements. The course begins with a discussion of general recognition and measurement issues and concepts, various income concepts, market efficiency perspectives and capital maintenance concepts. The course proceeds with critical examination of specific recognition and measurement issues and authoritative pronouncements related to various elements of the financial statements. The course concludes with a discussion of the gaps in GAAP. \n\nThis course also emphasizes skills and attitudes that are essential as accounting professionals. This course reinforces students' skills of inquiry, research, problem-solving, analytical and critical thinking, team work, communication and presentation. Important attitudes and values that this course aims to develop in students include professional and social awareness and responsibilities, receptiveness to differing views, and a passion for proactive self-learning.", "title": "ACCOUNTING RECOGNITION AND MEASUREMENT", "preclusion": "AA201", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 1, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE, BCG, MS, MS-2ndMaj/Spec(MSB)", "Not available to all Programme with: ", "2nd Maj/Spec(BUS)"], "prerequisite": "AA102 or AB1102 or AC1102"},
{"code": "AC2105", "description": "Accounting plays a vital role in business organizations' strive for resources and performance. Through the provision of useful information, accounting helps organizations attract resources from external stakeholders, and helps internal stakeholders manage these resources, to achieve the targeted performance. The process not only facilitates the creation of value for organizations and their stakeholders, it also benefits the economy and society as a whole, by helping to direct resources to where they can be more productive.\n\nBased upon the foundation established in the predecessor course AA101, this course focuses on the relevance of accounting information to internal stakeholders, i.e. management, to make decisions and achieve control in their strive for performance. Emphasis is placed on both the provision, as well as the application, of accounting information.", "title": "ACCOUNTING FOR DECISION MAKING & CONTROL", "preclusion": "AC2102", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 2, ACBS(GB) 3, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECON, EEE, EEEC, EESS, ELH, ENE, ENEC, ENG, HIST, IEEC, IEM, LMS, MAEC, MAT, MATH, ME, ME(DES), ME(MEC), MEEC, MEEC(DES), MEEC(MEC), MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSY, REP, SOC, SSM"], "prerequisite": "AA101 or AB1101 or AC1101"},
{"code": "AC2401", "description": "The purpose of this course is to help students to develop a strong conceptual foundation in accounting information systems, a necessary pre-requisite for effective performance in accountants and auditors in the current digital era. The course enables the students to understand, evaluate and use Accounting Information Systems effectively in their future roles as accountants, managers, consultants, or auditors. \n\nThe course seeks to: \n1) Provide an in-depth understanding of key business processes of an organization, and how the data captured during the business process flow through to management and financial accounting.\n2) Train students to model key business process activities and identify risk and control issues related to a business process\n3) Provide comprehensive knowledge about AIS packages and enterprise resource planning (ERP) packages and explain how AIS/ERP packages are implemented.\n4) Provide students with an overview of some key modules of an ERP and teach students the skills of using an industry standard package such as SAP. \n\nStudents will study how AIS/ERP is deployed in common business transactions. They will learn about the information flow in fundamental accounting processes and the major risks and controls associated with these processes. Students will be taught on how data is captured, processed, stored and accessed for generating management information and business reports and documents.\n\nStudents will gain hands-on training on ERP usage via lab sessions on SAP - an industry standard ERP package. With an understanding of the systems development process and knowledge of AIS deployment in accounting and business processes from pre-lab sessions, students will gain an appreciation of the underlying workings of a typical ERP/AIS. This learning and experience will equip them with knowledge for more effective sourcing, selection, implementation and deployment of AIS/ERP packages in practice. In addition, students will also learn how they can make use of Excel for more effective reporting from the data generated through AIS/ERP packages.", "title": "ACCOUNTING INFORMATION SYSTEMS", "preclusion": "AC213, BC203, BC2401", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE, BCG, BUS 1, BUS 2, BUS 3, MS-2ndMaj/Spec(MSB)", "Not available to all Programme with: ", "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(MKG)"], "prerequisite": "AB113 or AB1401"},
{"code": "AC3103", "description": "This course provides students with the conceptual background and analytical skills that are necessary to identify, assess and apply information for the purposes of analysing and valuing business activities and entities. The course employs the agency framework within a capital market context to help students develop the necessary analysis and valuation skills.\n\nEmphasis is placed on integrating the use of financial and non-financial information in business valuation and analysis, involving strategy analysis, accounting analysis, financial analysis, prospective analysis and valuation. The course allows students to understand the critical issue of determining the specific types of information that are relevant in ex ante valuation and ex post analysis of business entities and their activities. Students are also expected to be aware of the benefits and costs of acquiring and using such information. \nCases and projects are used to develop and integrate the business analysis and valuation concepts. Healthy scepticism is emphasized, as students are encouraged to challenge the assumptions and facts related to each issue. \n\nAfter the completion of this course, students should understand and appreciate some of the rationales and characteristics that underlie business practices and financial reporting. Students should also appreciate the myriad interactions among the process of business analysis and valuation, the use of information sets (accounting and non-accounting), and the workings of the capital markets.\n\nStudents are expected to develop important knowledge, skills and attitudes in AA301. The main objectives are to develop students' (1) social and interpersonal skills, (2) technical knowledge of specific accounting standards, (3) technical knowledge of business valuation, (4) creative and critical thinking, (5) tolerance for ambiguity in a dynamic environment, and (6) strategic thinking and leadership capabilities in a vibrant environment.", "title": "ACCOUNTING ANALYSIS AND EQUITY VALUATION", "preclusion": "AA301", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, BCE, BCG, BUS 1, BUS 2, MS-2ndMaj/Spec(MSB)"], "prerequisite": "AA201 or AC2101"},
{"code": "AD2101", "description": "This course introduces managerial accounting at an introductory level. \na. The changing role of management accounting in a dynamic business environment\nb. Basic cost concepts and costing techniques\nc. Relevant costs and decision making\nd. Standard costing, budgeting and performance measurement\ne. Decentralization and responsibility accounting\nf. Strategic management accounting and business sustainability", "title": "MANAGEMENT ACCOUNTING", "preclusion": "AB1102, BU8101", "credit": "4.0", "department": "ACC", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS, ACC, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BUS(HRC) 2, BUS(MKG) 2, BUS(RMI) 2, BUS(THM) 2, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECMA, ECON, ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, IEEC, IEM, LMS, MAEC, MAT, MATH, ME, ME(DES), ME(MEC), MEEC, MEEC(DES), MEEC(MEC), MS(ITG), MS-2ndMaj/Spec(ITG), MS-2ndMaj/Spec(NULL), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SOC, SSM", "Not available to all Programme with: ", "(Admyr 2004-2013)"], "prerequisite": "AD1101 or AB1101"},
{"code": "AD1101", "description": "1. Understanding a set of real world financial statements\n2. Analysing and interpreting financial statement information", "title": "FINANCIAL ACCOUNTING", "preclusion": "AB1101, AC1101, BU8101, EE8062", "credit": "4.0", "department": "BUS", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BUS 1, BUS 2, BUS 3, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECMA, ECON, ECPP, ECPS, EEE, EEEC, ELAH, ELH, ENE, ENEC, ENG, IEEC, IEM, LMS, MAEC, MAT, MATH, ME, ME(DES), ME(MEC), MEEC, MEEC(DES), MEEC(MEC), MS-2ndMaj/Spec(ITG), MS-2ndMaj/Spec(MSB) 1, MS-2ndMaj/Spec(MSB) 2, MS-2ndMaj/Spec(MSB) 3, MS-2ndMaj/Spec(MSB) 4, MS-2ndMaj/Spec(NULL), MTEC, PHY, PPGA, PSLM, PSMA, PSY, SOC, SSM", "Not available to all Programme with: ", "(Admyr 2004-2013), 2nd Maj/Spec(ACC) Yr2, 2nd Maj/Spec(ACC) Yr3, 2nd Maj/Spec(ACC) Yr4, 2nd Maj/Spec(BAF) Yr2, 2nd Maj/Spec(BAF) Yr3, 2nd Maj/Spec(BAF) Yr4, 2nd Maj/Spec(BAT) Yr2, 2nd Maj/Spec(BAT) Yr3, 2nd Maj/Spec(BAT) Yr4, 2nd Maj/Spec(BUS) Yr2, 2nd Maj/Spec(BUS) Yr3, 2nd Maj/Spec(BUS) Yr4, 2nd Maj/Spec(MKG) Yr2, 2nd Maj/Spec(MKG) Yr3, 2nd Maj/Spec(MKG) Yr4"], "prerequisite": ""},
{"code": "BU8101", "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.\n\nStudents will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.\n\nTopics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization.", "title": "ACCOUNTING: A USER PERSPECTIVE", "preclusion": "AB1101, AC1101, AD1101, AD2101, EE0062, EE8062", "credit": "3.0", "department": "BUS", "gradeType": "", "availability": ["Not available to Programme: ", "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "Not available to all Programme with: ", "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(MKG)"], "prerequisite": ""}
]